app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.where("name " + (Rails.env.development? ? "LIKE" : "ilike")+ " ?", "%#{search_term}%")
    else
      @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "LA SPORTIVA ALPINE 4000!  "], ["description", "A versatile boot for all weather conditions."], ["image_url", ""], ["updated_at", 2016-12-06 18:08:32 UTC], ["id", 4]]