app/controllers/static_pages_controller.rb

  def landing_page
    @products = Product.all
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]